Revit 2027 API
RebarContainerItem.SetLayoutAsSingle Method
 Sets the Layout Rule property of rebar set to Single.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLayoutAsSingle()
Public Sub SetLayoutAsSingle
public:
void SetLayoutAsSingle()
member SetLayoutAsSingle : unit -> unit
Remarks
 Only one bar will remain, which is at the position of rebar plane
See Also
Reference
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace